// pages/test/testResult/testResult.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    res: {
      summary: "最近你经常感到持续性的心情低落，缺乏活力，对周围的事情失去了原有的兴趣。",
      paragraph: [{
        title: "小标题1",
        content: "最近你经常感到持续性的心境低落，缺乏活力，对周围的事情失去了原有的兴趣；无法集中注意力，不想工作和学习，即使勉强工作，效率也非常低；记性变的很差，常常忘东忘西；容易感到疲倦和孤独，不愿意运动，也不愿意外出社交。"
      }, {
        title: "小标题2",
        content: "最近你经常感到持续性的心境低落，缺乏活力，对周围的事情失去了原有的兴趣；无法集中注意力，不想工作和学习，即使勉强工作，效率也非常低；记性变的很差，常常忘东忘西；容易感到疲倦和孤独，不愿意运动，也不愿意外出社交。"
      }]
    },
    advice: {
      summary: "应该注重内心的调解，多喝亲人朋友沟通，加强运动和锻炼。",
      paragraph: [{
        title: "小标题1",
        content: "最近你经常感到持续性的心境低落，缺乏活力，对周围的事情失去了原有的兴趣；无法集中注意力，不想工作和学习，即使勉强工作，效率也非常低；记性变的很差，常常忘东忘西；容易感到疲倦和孤独，不愿意运动，也不愿意外出社交。"
      }, {
        title: "小标题2",
        content: "最近你经常感到持续性的心境低落，缺乏活力，对周围的事情失去了原有的兴趣；无法集中注意力，不想工作和学习，即使勉强工作，效率也非常低；记性变的很差，常常忘东忘西；容易感到疲倦和孤独，不愿意运动，也不愿意外出社交。"
      }]
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})